/** JOIN **/

/* EQUI Join */
-- 직원(employees)들의 이름, 부서아이디(직원), 부서명, 부서아이디를 출럭하세요 (부서가 없는 사람은 제외)
-- 부서가 없는 직원을 제외한 모든 직원의 직원이름, 부서이름, 업무명 을 출력하세요

/* left outer join */
-- 부서가 없는 직원을 포함한 모든직원의 부서아이디, 이름, 부서명을 출력하세요
-- 위 예제를 오라클에서 제공하는 약칭으로 출력하세요

/* right outer join */
-- 부서원이 없는 부서를 포함하여 모든 부서의 직원들의 부서아이디, 이름, 부서명을 출력하세요
-- 위 예제를 오라클에서 제공하는 약칭으로 출력하세요

/* full outer join */
-- 부서가 없는 직원 포함하여 모든직원의 부서아이디, 이름, 부서명을 출력하세요, 이때 부서원이 없는 부서도 출력하세요

/* self join */
-- 매니저가 있는 직원의 직원아이디, 이름, 매니저아이디, 매니저를 출력하세요
-- 모든 직원의 직원아이디, 이름, 매니저아이디, 매니저를 출력하세요
-- 위 예제를 오라클에서 제공하는 약칭으로 출력하세요